# importando base

In [0]:
import pandas as pd
import numpy as np

In [59]:
dados =pd.read_csv('tips.csv')
dados.head(7)

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4
5       25.29  4.71      No  Sun  Dinner     4
6        8.77  2.00      No  Sun  Dinner     2

# Tradução

In [60]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [0]:
renomear={
    'total_bill' : 'valor_da_conta',
    'tip' : 'gorjeta',
    'dessert' : 'sobremesa',
    'day' : 'dia',
    'time' : 'hora_do_dia',
    'size' : 'total_de_pessoas'
}

In [0]:
gorjetas=dados.rename(columns=renomear)

In [63]:
gorjetas.head(5)

   valor_da_conta  gorjeta sobremesa  dia hora_do_dia  total_de_pessoas
0           16.99     1.01        No  Sun      Dinner                 2
1           10.34     1.66        No  Sun      Dinner                 3
2           21.01     3.50        No  Sun      Dinner                 3
3           23.68     3.31        No  Sun      Dinner                 2
4           24.59     3.61        No  Sun      Dinner                 4

In [0]:
gorjetas.sobremesa.unique()

sim_nao ={
    'No' : 'Não',
    'Yes' : 'Sim'
}

In [65]:
gorjetas.sobremesa.map(sim_nao).head(10)

0    Não
1    Não
2    Não
3    Não
4    Não
5    Não
6    Não
7    Não
8    Não
9    Não
Name: sobremesa, dtype: object

In [0]:
gorjetas.sobremesa=gorjetas.sobremesa.map(sim_nao)

In [67]:
gorjetas.head(5)

   valor_da_conta  gorjeta sobremesa  dia hora_do_dia  total_de_pessoas
0           16.99     1.01       Não  Sun      Dinner                 2
1           10.34     1.66       Não  Sun      Dinner                 3
2           21.01     3.50       Não  Sun      Dinner                 3
3           23.68     3.31       Não  Sun      Dinner                 2
4           24.59     3.61       Não  Sun      Dinner                 4

In [68]:
gorjetas.dia.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [69]:
dia_semana={
    'Sun' : 'Domingo',
    'Sat' : 'Sabado',
    'Thur' : 'Terça',
    'Fri' : 'Sexta'
}

gorjetas.dia=gorjetas.dia.map(dia_semana)
gorjetas.head(5)

   valor_da_conta  gorjeta sobremesa      dia hora_do_dia  total_de_pessoas
0           16.99     1.01       Não  Domingo      Dinner                 2
1           10.34     1.66       Não  Domingo      Dinner                 3
2           21.01     3.50       Não  Domingo      Dinner                 3
3           23.68     3.31       Não  Domingo      Dinner                 2
4           24.59     3.61       Não  Domingo      Dinner                 4

In [70]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [71]:
hora= {
    'Dinner' : 'Jantar',
    'Lunch' : 'Almoço'
}

gorjetas.hora_do_dia=gorjetas.hora_do_dia.map(hora)
gorjetas.head(5)

   valor_da_conta  gorjeta sobremesa      dia hora_do_dia  total_de_pessoas
0           16.99     1.01       Não  Domingo      Jantar                 2
1           10.34     1.66       Não  Domingo      Jantar                 3
2           21.01     3.50       Não  Domingo      Jantar                 3
3           23.68     3.31       Não  Domingo      Jantar                 2
4           24.59     3.61       Não  Domingo      Jantar                 4